#### Check! Terraform Show Plans 🖌`
<details><summary>Dev Show Plan</summary>

```

terraform
module.bastion.data.aws_ssm_parameter.this: Reading...
module.bastion.data.aws_iam_policy.this: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08f30cd5b2a47d024]
module.bastion.data.aws_iam_policy.this: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.bastion.data.aws_ssm_parameter.this: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b18bd1643342dfcb]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d3444a50feb27b24]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0fbad634796457170]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0401154a166d47b5d]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-048782bb543f74ba7]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05414bbda2d10c5c0]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d8814c3bb5cdaaa2]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07898d78f0f366a61]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0afbbbec3ba03780a]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0feb39dda6b20a584]
module.vpc.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0e1fe5952c2b57bdc]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0770baa802341b67b]
module.vpc.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03d67a4dd13321c16]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f76d02c999b2880e]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-06cf828a8a8603c8b]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0770baa802341b67b1080289494]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ed8dfafd55f2fc5]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-066b2e9cb82d368fe]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0337c98e014064d99]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03f42a75257bfb1b3]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09aa6e23db2410fa8]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0141051babfa6c4e7]
module.vpc.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0669ba96655a29f80]
module.vpc.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0e219a38347601e23]
module.vpc.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d8814c3bb5cdaaa21080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07898d78f0f366a611080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "dev-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-0401154a166d47b5d",
          + "subnet-0fbad634796457170",
        ]
      + tags                                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-alb"
          + "Terraform"   = "true"
        }
      + tags_all                                    = {
          + "Environment" = "dev"
          + "Name"        = "dev-alb"
          + "Terraform"   = "true"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "dev-sg-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-alb"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-alb"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-08f30cd5b2a47d024"
    }

  # module.bastion.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "dev-iam-instance-profile-bastion"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "dev-iam-role-bastion"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.bastion.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-iam-role-bastion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.bastion.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "dev-iam-role-bastion"
    }

  # module.bastion.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "dev-iam-instance-profile-bastion"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0feb39dda6b20a584"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-bastion"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "dev-bastion"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "from rivate"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "dev-sg-bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-bastion"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-bastion"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-08f30cd5b2a47d024"
    }

  # module.ecr.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "go-api-sample-todo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecr-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecr-go-api-sample-todo"
          + "Terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/go-api-sample-todo/dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "dev-ecs-cluster-go-api-sample-todo"
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecs-cluster-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecs-cluster-go-api-sample-todo"
          + "Terraform"   = "true"
        }

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dev-ecs-service-go-api-sample-todo"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecs-service-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-ecs-service-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-api-sample-todo"
          + container_port   = 80
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0afbbbec3ba03780a",
              + "subnet-0feb39dda6b20a584",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + image            = "nginx:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/go-api-sample-todo/dev"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-api-sample-todo"
                        }
                    }
                  + name             = "go-api-sample-todo"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "dev-task-definition-go-api-sample-todo"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "dev-task-definition-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-task-definition-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-ecs-execution-role-go-api-sample-todo"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id     = (known after apply)
      + name   = "dev-ecs-execution-role-policy-go-api-sample-todo"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "dev-ecs-execution-role-go-api-sample-todo"
    }

  # module.ecs.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "dev-lb-http-listener-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "dev-lb-http-listener-go-api-sample-todo"
          + "Terraform"   = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs.aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "dev-alb-tg-go-api-sample-todo"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "dev-alb-tg-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-alb-tg-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-08f30cd5b2a47d024"

      + health_check (known after apply)

      + stickiness (known after apply)

      + target_failover (known after apply)
    }

  # module.ecs.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "dev-sg-go-api-sample-todo"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "dev-sg-go-api-sample-todo"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-go-api-sample-todo"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-08f30cd5b2a47d024"
    }

  # module.rds.aws_rds_cluster.this will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = [
          + "ap-northeast-1a",
          + "ap-northeast-1c",
        ]
      + backup_retention_period         = 1
      + cluster_identifier              = "dev-cluster-todo"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "todo"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "dev-vpc"
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "8.0.mysql_aurora.3.02.0"
      + engine_version_actual           = (known after apply)
      + final_snapshot_identifier       = "dev-cluster-final-snapshot-todo"
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = "admin"
      + network_type                    = (known after apply)
      + port                            = 3306
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = (known after apply)
      + storage_type                    = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "dev-cluster-todo"
          + "Terraform"   = "true"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-cluster-todo"
          + "Terraform"   = "true"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.rds.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "8.0.mysql_aurora.3.02.0"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dev-todo-0"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "dev-todo-0"
          + "Terraform"   = "true"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "dev-todo-0"
          + "Terraform"   = "true"
        }
      + writer                                = (known after apply)
    }

  # module.rds.aws_rds_cluster_parameter_group.this will be created
  + resource "aws_rds_cluster_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "aurora-mysql8.0"
      + id          = (known after apply)
      + name        = "dev-rds-cluster-parameter-group-todo"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Tokyo"
        }
    }

  # module.rds.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-sg-rds-todo"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-rds-todo"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-rds-todo"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-08f30cd5b2a47d024"
    }

  # module.rds.aws_security_group_rule.this will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "192.168.1.32/28",
          + "192.168.1.48/28",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds.aws_ssm_parameter.cluster_endpoint will be created
  + resource "aws_ssm_parameter" "cluster_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/rds/todo/endpoint_w"
      + tags           = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tags_all       = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.cluster_reader_endpoint will be created
  + resource "aws_ssm_parameter" "cluster_reader_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/rds/todo/endpoint_r"
      + tags           = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tags_all       = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.master_password will be created
  + resource "aws_ssm_parameter" "master_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/rds/todo/master_password"
      + tags           = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tags_all       = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.master_username will be created
  + resource "aws_ssm_parameter" "master_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/rds/todo/master_username"
      + tags           = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tags_all       = {
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.random_password.this will be created
  + resource "random_password" "this" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#&,:;_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 28 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Ixy-194, Action: `pull_request`*